{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "batch_input_shape": [null, 64, 32, 1], "dtype": "float32", "activation": "relu", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "filters": 32, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "relu", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_3", "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "relu", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_3", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_4", "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "relu", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_4", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_5", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "bias_constraint": null, "activation": "softmax", "units": 260}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}