{"backend": "tensorflow", "keras_version": "2.2.2", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 32, 1]}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activation": "linear", "filters": 32, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "conv2d_1", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "dropout_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"name": "conv2d_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"activation": "linear", "filters": 32, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "conv2d_2", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"name": "dropout_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"name": "dropout_2", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"name": "conv2d_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"activation": "linear", "filters": 64, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "conv2d_3", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "max_pooling2d_2", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"name": "dropout_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "dropout_3", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"name": "conv2d_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"activation": "linear", "filters": 64, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "conv2d_4", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "max_pooling2d_3", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"name": "dropout_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"name": "dropout_4", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"name": "reshape_1", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"name": "reshape_1", "target_shape": [-1, 64], "trainable": true}, "class_name": "Reshape"}, {"name": "bidirectional_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"name": "bidirectional_1", "merge_mode": "sum", "trainable": true, "layer": {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "units": 32, "stateful": false, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null, "name": "cu_dnngru_1", "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "kernel_regularizer": null, "kernel_constraint": null, "return_state": false}, "class_name": "CuDNNGRU"}}, "class_name": "Bidirectional"}, {"name": "dropout_5", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"name": "dropout_5", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"name": "bidirectional_2", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"name": "bidirectional_2", "merge_mode": "sum", "trainable": true, "layer": {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "units": 32, "stateful": false, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null, "name": "cu_dnngru_2", "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "kernel_regularizer": null, "kernel_constraint": null, "return_state": false}, "class_name": "CuDNNGRU"}}, "class_name": "Bidirectional"}, {"name": "dropout_6", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]], "config": {"name": "dropout_6", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"name": "time_distributed_1", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"name": "time_distributed_1", "trainable": true, "layer": {"config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 32, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}, {"name": "dropout_7", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "config": {"name": "dropout_7", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"name": "time_distributed_2", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"name": "time_distributed_2", "trainable": true, "layer": {"config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 32, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}, {"name": "dropout_8", "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "config": {"name": "dropout_8", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"name": "flatten_1", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"name": "dropout_9", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"name": "dropout_9", "seed": null, "trainable": true, "rate": 0.3, "noise_shape": null}, "class_name": "Dropout"}, {"name": "output", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 5, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "output", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "output_layers": [["output", 0, 0]]}, "class_name": "Model"}