{"backend": "tensorflow", "config": {"output_layers": [["output", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 64, 32, 1]}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "filters": 32, "padding": "same", "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1]}, "name": "conv2d_1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "name": "activation_1", "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"seed": null, "rate": 0.2, "name": "dropout_1", "noise_shape": null, "trainable": true}, "name": "dropout_1", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "filters": 32, "padding": "same", "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1]}, "name": "conv2d_2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "name": "activation_2", "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"seed": null, "rate": 0.2, "name": "dropout_2", "noise_shape": null, "trainable": true}, "name": "dropout_2", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "filters": 64, "padding": "same", "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1]}, "name": "conv2d_3", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "name": "activation_3", "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2]}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"seed": null, "rate": 0.2, "name": "dropout_3", "noise_shape": null, "trainable": true}, "name": "dropout_3", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "filters": 64, "padding": "same", "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1]}, "name": "conv2d_4", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "name": "activation_4", "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "strides": [2, 2]}, "name": "max_pooling2d_3", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"seed": null, "rate": 0.2, "name": "dropout_4", "noise_shape": null, "trainable": true}, "name": "dropout_4", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"name": "reshape_1", "trainable": true, "target_shape": [8, -1]}, "name": "reshape_1", "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"merge_mode": "sum", "layer": {"config": {"stateful": false, "kernel_regularizer": null, "go_backwards": false, "activity_regularizer": null, "name": "cu_dnngru_1", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "recurrent_constraint": null, "units": 32, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "return_state": false, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "CuDNNGRU"}, "name": "bidirectional_1", "trainable": true}, "name": "bidirectional_1", "class_name": "Bidirectional"}, {"inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"seed": null, "rate": 0.2, "name": "dropout_5", "noise_shape": null, "trainable": true}, "name": "dropout_5", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"merge_mode": "sum", "layer": {"config": {"stateful": false, "kernel_regularizer": null, "go_backwards": false, "activity_regularizer": null, "name": "cu_dnngru_2", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "recurrent_constraint": null, "units": 32, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "return_state": false, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "CuDNNGRU"}, "name": "bidirectional_2", "trainable": true}, "name": "bidirectional_2", "class_name": "Bidirectional"}, {"inbound_nodes": [[["bidirectional_2", 0, 0, {}]]], "config": {"seed": null, "rate": 0.2, "name": "dropout_6", "noise_shape": null, "trainable": true}, "name": "dropout_6", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"layer": {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, "name": "time_distributed_1", "trainable": true}, "name": "time_distributed_1", "class_name": "TimeDistributed"}, {"inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "config": {"seed": null, "rate": 0.2, "name": "dropout_7", "noise_shape": null, "trainable": true}, "name": "dropout_7", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"layer": {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "name": "dense_2", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, "name": "time_distributed_2", "trainable": true}, "name": "time_distributed_2", "class_name": "TimeDistributed"}, {"inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "config": {"seed": null, "rate": 0.2, "name": "dropout_8", "noise_shape": null, "trainable": true}, "name": "dropout_8", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"seed": null, "rate": 0.3, "name": "dropout_9", "noise_shape": null, "trainable": true}, "name": "dropout_9", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "activity_regularizer": null, "name": "output", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 260, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "name": "output", "class_name": "Dense"}]}, "class_name": "Model", "keras_version": "2.2.2"}