{"config": {"layers": [{"config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 64, 32, 1], "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"rate": 0.2, "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_2", "bias_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2]}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"rate": 0.2, "noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "dilation_rate": [1, 1], "filters": 64, "name": "conv2d_3", "bias_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2]}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"config": {"rate": 0.2, "noise_shape": null, "name": "dropout_3", "trainable": true, "seed": null}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "dilation_rate": [1, 1], "filters": 64, "name": "conv2d_4", "bias_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2]}, "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"config": {"rate": 0.2, "noise_shape": null, "name": "dropout_4", "trainable": true, "seed": null}, "name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"config": {"name": "reshape_1", "trainable": true, "target_shape": [8, -1]}, "name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"layer": {"config": {"go_backwards": false, "units": 32, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "return_sequences": true, "name": "cu_dnngru_1", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null}, "class_name": "CuDNNGRU"}, "name": "bidirectional_1", "trainable": true, "merge_mode": "sum"}, "name": "bidirectional_1", "class_name": "Bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"config": {"rate": 0.2, "noise_shape": null, "name": "dropout_5", "trainable": true, "seed": null}, "name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"config": {"layer": {"config": {"go_backwards": false, "units": 32, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "return_sequences": true, "name": "cu_dnngru_2", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null}, "class_name": "CuDNNGRU"}, "name": "bidirectional_2", "trainable": true, "merge_mode": "sum"}, "name": "bidirectional_2", "class_name": "Bidirectional", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"config": {"rate": 0.3, "noise_shape": null, "name": "dropout_6", "trainable": true, "seed": null}, "name": "dropout_6", "class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"units": 260, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "name": "output", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "name": "output", "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["output", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.2"}