{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 32, 1], "dtype": "float32", "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "name": "conv2d_1", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 32, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "name": "dropout_1", "noise_shape": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 32, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "name": "dropout_2", "noise_shape": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "name": "conv2d_3", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 64, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "name": "dropout_3", "noise_shape": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "name": "conv2d_4", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 64, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "name": "dropout_4", "noise_shape": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"trainable": true, "name": "reshape_1", "target_shape": [-1, 64]}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"units": 32, "return_sequences": true, "implementation": 1, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "activation": "tanh", "kernel_regularizer": null, "go_backwards": false, "stateful": false, "reset_after": false, "trainable": true, "recurrent_dropout": 0.2, "activity_regularizer": null, "name": "gru_1", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, "merge_mode": "sum", "name": "bidirectional_1", "trainable": true}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "bidirectional_2", "class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"units": 32, "return_sequences": true, "implementation": 1, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "activation": "tanh", "kernel_regularizer": null, "go_backwards": false, "stateful": false, "reset_after": false, "trainable": true, "recurrent_dropout": 0.2, "activity_regularizer": null, "name": "gru_2", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, "merge_mode": "sum", "name": "bidirectional_2", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"units": 32, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true}}}, "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "name": "dropout_5", "noise_shape": null}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_2", "layer": {"class_name": "Dense", "config": {"units": 32, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true}}}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "name": "dropout_6", "noise_shape": null}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "seed": null, "name": "dropout_7", "noise_shape": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"units": 5, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "output", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["output", 0, 0]]}}